In [1]:
!pip install sweetviz

Requirement already satisfied: sweetviz in c:\users\owner\miniconda3\lib\site-packages (2.1.3)
Requirement already satisfied: scipy>=1.3.2 in c:\users\owner\miniconda3\lib\site-packages (from sweetviz) (1.8.0)
Requirement already satisfied: numpy>=1.16.0 in c:\users\owner\miniconda3\lib\site-packages (from sweetviz) (1.22.2)
Requirement already satisfied: tqdm>=4.43.0 in c:\users\owner\miniconda3\lib\site-packages (from sweetviz) (4.61.2)
Requirement already satisfied: pandas!=1.0.0,!=1.0.1,!=1.0.2,>=0.25.3 in c:\users\owner\miniconda3\lib\site-packages (from sweetviz) (1.4.0)
Requirement already satisfied: matplotlib>=3.1.3 in c:\users\owner\miniconda3\lib\site-packages (from sweetviz) (3.5.1)
Requirement already satisfied: importlib-resources>=1.2.0 in c:\users\owner\miniconda3\lib\site-packages (from sweetviz) (5.4.0)
Requirement already satisfied: jinja2>=2.11.1 in c:\users\owner\miniconda3\lib\site-packages (from sweetviz) (3.0.3)
Requirement already satisfied: zipp>=3.1.0 in c:\users\owner\miniconda3\lib\site-packages (from importlib-resources>=1.2.0->sweetviz) (3.7.0)
Requirement already satisfied: MarkupSafe>=2.0 in c:\users\owner\miniconda3\lib\site-packages (from jinja2>=2.11.1->sweetviz) (2.0.1)
Requirement already satisfied: pillow>=6.2.0 in c:\users\owner\miniconda3\lib\site-packages (from matplotlib>=3.1.3->sweetviz) (9.0.1)
Requirement already satisfied: kiwisolver>=1.0.1 in c:\users\owner\miniconda3\lib\site-packages (from matplotlib>=3.1.3->sweetviz) (1.3.2)
Requirement already satisfied: packaging>=20.0 in c:\users\owner\miniconda3\lib\site-packages (from matplotlib>=3.1.3->sweetviz) (21.3)
Requirement already satisfied: pyparsing>=2.2.1 in c:\users\owner\miniconda3\lib\site-packages (from matplotlib>=3.1.3->sweetviz) (3.0.7)
Requirement already satisfied: python-dateutil>=2.7 in c:\users\owner\miniconda3\lib\site-packages (from matplotlib>=3.1.3->sweetviz) (2.8.2)
Requirement already satisfied: fonttools>=4.22.0 in c:\users\owner\miniconda3\lib\site-packages (from matplotlib>=3.1.3->sweetviz) (4.29.1)
Requirement already satisfied: cycler>=0.10 in c:\users\owner\miniconda3\lib\site-packages (from matplotlib>=3.1.3->sweetviz) (0.11.0)
Requirement already satisfied: pytz>=2020.1 in c:\users\owner\miniconda3\lib\site-packages (from pandas!=1.0.0,!=1.0.1,!=1.0.2,>=0.25.3->sweetviz) (2021.3)
Requirement already satisfied: six>=1.5 in c:\users\owner\miniconda3\lib\site-packages (from python-dateutil>=2.7->matplotlib>=3.1.3->sweetviz) (1.16.0)
Requirement already satisfied: colorama in c:\users\owner\miniconda3\lib\site-packages (from tqdm>=4.43.0->sweetviz) (0.4.4)

In [2]:
import pandas as pd
import numpy as np

In [3]:
data = pd.read_csv ('https://archive.ics.uci.edu/ml/machine-learning-databases/adult/adult.data')

In [4]:
data['is_above_50K'] = data[' <=50K'] == ' >50K'
cols = ['age', 
'workclass', 
'fnlwgt', 
'education', 
'education-num', 
'marital-status', 
'occupation', 
'relationship', 
'race', 
'sex', 
'capital-gain', 
'capital-loss', 
'hours-per-week', 
'native-country', '<=50k', 'is_above_50k'] 

data.columns = cols

In [5]:
!pip install plotly

Requirement already satisfied: plotly in c:\users\owner\miniconda3\lib\site-packages (5.6.0)
Requirement already satisfied: six in c:\users\owner\miniconda3\lib\site-packages (from plotly) (1.16.0)
Requirement already satisfied: tenacity>=6.2.0 in c:\users\owner\miniconda3\lib\site-packages (from plotly) (8.0.1)

In [6]:
import plotly.express as px

In [7]:
data['is_above_50k_int'] = np.where (data['is_above_50k'], 1, 0)

**Undersample the data**  
* Need to undersample the majority class to create realisistic links between independent variables.
* If not undersampled, this can lead to majority class over-representing a group that is contributing to the income 
NOTE: explore different ways, such representing data as a ratio

In [8]:
sample_df = data[['education', 	'age', 'sex', 'is_above_50k_int']]
sample_df[sample_df['is_above_50k_int'] == 0].shape

(24719, 4)

In [9]:
sample_df

         education  age      sex  is_above_50k_int
0        Bachelors   50     Male                 0
1          HS-grad   38     Male                 0
2             11th   53     Male                 0
3        Bachelors   28   Female                 0
4          Masters   37   Female                 0
...            ...  ...      ...               ...
32555   Assoc-acdm   27   Female                 0
32556      HS-grad   40     Male                 1
32557      HS-grad   58   Female                 0
32558      HS-grad   22     Male                 0
32559      HS-grad   52   Female                 1

[32560 rows x 4 columns]

In [10]:
num_sample = sample_df[sample_df['is_above_50k_int'] == 1].shape[0]

In [75]:
below_50k_df = sample_df[sample_df['is_above_50k_int'] == 0].sample (n=num_sample)
above_50k_df = sample_df[sample_df['is_above_50k_int'] == 1]
data_df = pd.concat ((above_50k_df, below_50k_df))

* According to the plot, higher education contributes strongly to the likelyhood of income over 50K
* Split Ed into 2 groups Bachelors and above and below Bacherlors

In [76]:
data_df

           education  age      sex  is_above_50k_int
6            HS-grad   52     Male                 1
7            Masters   31   Female                 1
8          Bachelors   42     Male                 1
9       Some-college   37     Male                 1
10         Bachelors   30     Male                 1
...              ...  ...      ...               ...
11103      Bachelors   27   Female                 0
14830        Masters   48     Male                 0
24954      Bachelors   28     Male                 0
11086            9th   69     Male                 0
25101           12th   51     Male                 0

[15682 rows x 4 columns]

In [77]:
#para`llel_set_df = data_df[['education', 	'age', 'sex', 'is_above_50k_int']].groupby(['education', 	'age', 'sex']).count().reset_index()
data_df['Higher_Education'] = data_df['education'].apply (lambda x: x in set ([' Bachelors', ' Doctorate', ' Masters', ' Prof-school']))

It looks like there is strong correlation between people between ages 35 and 65 and probability to be above 50K

In [78]:
data_df

           education  age      sex  is_above_50k_int  Higher_Education
6            HS-grad   52     Male                 1             False
7            Masters   31   Female                 1              True
8          Bachelors   42     Male                 1              True
9       Some-college   37     Male                 1             False
10         Bachelors   30     Male                 1              True
...              ...  ...      ...               ...               ...
11103      Bachelors   27   Female                 0              True
14830        Masters   48     Male                 0              True
24954      Bachelors   28     Male                 0              True
11086            9th   69     Male                 0             False
25101           12th   51     Male                 0             False

[15682 rows x 5 columns]

In [79]:
data_df['age_btw_35_and_65'] = data_df['age'].apply (lambda x: (x >= 35) & (x<= 65) )

In [80]:
parallel_set_df = data_df[['Higher_Education', 'age_btw_35_and_65', 'sex','is_above_50k_int']]

In [81]:
parallel_set_df

       Higher_Education  age_btw_35_and_65      sex  is_above_50k_int
6                 False               True     Male                 1
7                  True              False   Female                 1
8                  True               True     Male                 1
9                 False               True     Male                 1
10                 True              False     Male                 1
...                 ...                ...      ...               ...
11103              True              False   Female                 0
14830              True               True     Male                 0
24954              True              False     Male                 0
11086             False              False     Male                 0
25101             False               True     Male                 0

[15682 rows x 4 columns]

In [83]:
import plotly.graph_objects as go
import pandas as pd

# Create dimensions
Higher_Education_dim = go.parcats.Dimension(
    values=parallel_set_df.Higher_Education,
    categoryorder='category ascending', label="Higher_Education"
)

age_dim = go.parcats.Dimension(values=parallel_set_df.age_btw_35_and_65, label="Age Group[35-65]")
sex_dim = go.parcats.Dimension(values=parallel_set_df.sex, label="Genter")

is_above_50K_dim = go.parcats.Dimension(
    values=parallel_set_df.is_above_50k_int, label="Income > 50K", categoryarray=[0, 1],
    ticktext=['Below', 'Above']
)


color = parallel_set_df.is_above_50k_int;
colorscale = [[0, 'lightsteelblue'], [1, 'mediumseagreen']];

fig = go.Figure(data = [go.Parcats(dimensions=[Higher_Education_dim, age_dim, sex_dim, is_above_50K_dim],
        line={'color': color, 'colorscale': colorscale},
        hoveron='color', hoverinfo='count+probability',
        labelfont={'size': 18, 'family': 'Times'},
        tickfont={'size': 16, 'family': 'Times'},
        arrangement='freeform')])

![](images/parallel_coord_plot.png)